/**
  ************************************
  * @file    debug.c
  * @author  缪辉
  * @version V3.5.0
  * @date    2015.08.11
  * @brief   调试参数函数
	************************************
*/

#include "debug.h"

/**
  ************************************
  * @brief  慢速直走
  * @param  Left:1520   Right:1478
  * @retval 停止：1500
	************************************
*/
void Run_Slow(void)
{
	Run(1519,1479);
}

/**
  ************************************
  * @brief  快速直走
  * @param  Left:1581   Right:1425
  * @retval 停止：1500
	************************************
*/
void Run_Fast(void)
{
	Run(1581,1425);
}

/**
  ************************************
  * @brief  慢速后退
  * @param  Left:1450   Right:1547
  * @retval 停止：1500
	************************************
*/
void Run_Back(void)
{
	Run(1450,1547);
}

/**
  ************************************
  * @brief  原地顺时针
  * @param  Left:1538   Right:1540
  * @retval 停止：1500
	************************************
*/
void Clockwise(void)
{
	Run(1538,1540);//1538 1540
}

/**
  ************************************
  * @brief  原地逆时针
  * @param  Left:1460   Right:1462
  * @retval 停止：1500
	************************************
*/
void AntiClockwise(void)
{
	Run(1458,1458);//1458 1461
}
